# coding=UTF-8
from flask import Flask, render_template

# instancia o app
app = Flask(__name__)
app.config.from_object('config.ProductionConfig')

############################################################################################################################################
# inicia o site
@app.route('/')
def index():

    return render_template("index.html")
############################################################################################################################################
@app.route('/skills')
def skills():

    return render_template('skills.html')
############################################################################################################################################
@app.route('/projetos')
def projetos():

    return "<h1>Página projetos em construção</h1>"
############################################################################################################################################
@app.route('/sobre')
def sobre():

    return "<h1>Página sobre em construção</h1>"
############################################################################################################################################
@app.route('/contato')
def contato():

    return "<h1>Página contato em construção</h1>"
############################################################################################################################################
# inicia o servidor
if __name__ == "__main__":
    app.run()


